{
  "langName": "English",
  "langFlag": "🌐",
  "navInicio": "Home",
  "navSobreMi": "About Me",
  "navProyectos": "Projects",
  "navContacto": "Contact",
  "heroTitle": "Alba Reborido",
  "heroSubtitle": "Web Designer • Frontend Developer",
  "heroDescription": "I love turning ideas into simple and attractive digital experiences, designed for people.",
  "heroBtn": "See my projects",
  "aboutTitle": "About Me",
  "aboutLead": "I love turning ideas into simple and attractive digital experiences, designed for people.",
  "aboutText": "I am currently learning and developing my own projects, exploring new tools and techniques to improve my skills and better understand how to create intuitive and effective digital solutions.",
  "projectsTitle": "My Projects",
  "projectsDescription": "Each of these projects reflects a stage in my evolution as a web designer. I enjoy exploring new tools and visual approaches, with the constant goal of improving user experience and elevating code quality. I stay open to continuous learning and challenges that allow me to grow professionally.",
  "contactTitle": "Contact",
  "contactDescription": "If you are looking for a creative web designer, committed and eager to keep learning, I would be happy to meet you. You can write to me directly through the form or contact me via social networks.",
  "contactName": "Name",
  "contactEmail": "Email",
  "contactMessage": "Message",
  "contactSend": "Send message",
  "contactNameError": "⚠️ This field is required.",
  "contactEmailErrorEmpty": "⚠️ Please enter your email address.",
  "contactEmailErrorInvalid": "⚠️ Invalid email format.",
  "contactMessageError": "⚠️ Please write a message.",
  "thankYouMessage": "Thank you for your message! I’ll get back to you as soon as possible. In the meantime, feel free to keep exploring my work.",
  "contactLinksPrefix": "You can write to me directly at",
  "contactLinksSuffix": "or find me on social networks:",
  "footerCopyright": "© 2025 Alba Reborido – Web Designer",
  "contactSummary": "Each project I create is an opportunity to learn, grow, and connect. If you liked what you've seen and think we could create something interesting together, I'd love to hear from you. Whether it's a collaboration, a job offer, or just an idea you'd like to share, this space is open to you.",
  "project1Title": "Hair Salon Website",
  "project1Desc": "Design of a fictional website for a hair salon, with semantic structure and responsive layout. Includes clear navigation, service and contact sections, and visual components using Bootstrap.",
  "project1Btn": "Visit website",
  "project2Title": "Personal Portfolio",
  "project2Desc": "This website you're visiting. Developed to showcase my professional profile, projects, and contact. I worked on layout, accessibility, and intuitive navigation that reflects my style as a web designer.",
  "project2Btn": "View project",
  "project3Title": "Video Game Page",
  "project3Desc": "Experimental design of a themed page about video games. Uses Tailwind CSS to style components, focusing on typography, colors, and modular structure.",
  "project3Btn": "Visit website",
  "projectTech": "Technologies:",
  "project4Title": "3D Design",
  "project4Desc": "Experimental project where I created a 3D character inspired by Minecraft style. I used Three.js to render the model in the browser, applying basic textures and camera control to explore the environment.",
  "backToHome": "Back to home"

}
