{
  "langName": "Español",
  "langFlag": "🌐",
  "navInicio": "Inicio",
  "navSobreMi": "Sobre mí",
  "navProyectos": "Proyectos",
  "navContacto": "Contacto",
  "heroTitle": "Alba Reborido",
  "heroSubtitle": "Diseñadora Web • Frontend Developer",
  "heroDescription": "Me apasiona transformar ideas en experiencias digitales simples y atractivas, pensadas para las personas.",
  "heroBtn": "Ver mis proyectos",
  "aboutTitle": "Sobre mí",
  "aboutLead": "Me apasiona transformar ideas en experiencias digitales simples y atractivas, pensadas para las personas.",
  "aboutText": "Actualmente estoy aprendiendo y desarrollando proyectos propios, explorando nuevas herramientas y técnicas para mejorar mis habilidades y entender mejor cómo crear soluciones digitales intuitivas y efectivas.",
  "projectsTitle": "Mis Proyectos",
  "projectsDescription": "Cada uno de estos proyectos refleja una etapa en mi evolución como diseñadora web. Disfruto explorando nuevas herramientas y enfoques visuales, con el objetivo constante de perfeccionar la experiencia del usuario y elevar la calidad del código. Me mantengo abierta al aprendizaje continuo y a los desafíos que me permitan crecer profesionalmente.",
  "contactTitle": "Contacto",
  "contactDescription": "Si estás buscando una diseñadora web creativa, comprometida y con ganas de seguir aprendiendo, estaré encantada de conocerte. Puedes escribirme directamente a través del formulario o contactarme por redes.",
  "contactName": "Nombre",
  "contactEmail": "Correo electrónico",
  "contactMessage": "Mensaje",
  "contactSend": "Enviar mensaje",
  "contactNameError": "⚠️ Este campo es obligatorio.",
  "contactEmailErrorEmpty": "⚠️ Introduce tu correo electrónico.",
  "contactEmailErrorInvalid": "⚠️ El formato del correo no es válido.",
  "contactMessageError": "⚠️ Escribe un mensaje.",
  "contactLinksPrefix": "Puedes escribirme directamente a",
  "contactLinksSuffix": "o encontrarme en redes:",
  "thankYouMessage": "¡Gracias por tu mensaje! Me pondré en contacto contigo lo antes posible. Mientras tanto, si quieres seguir explorando mi trabajo, estás en el lugar perfecto.",
  "footerCopyright": "© 2025 Alba Reborido – Diseñadora Web",
  "contactSummary": "Cada proyecto que realizo es una oportunidad para aprender, crecer y conectar. Si te ha gustado lo que has visto y crees que podríamos crear algo interesante juntos, estaré encantada de escucharte. Ya sea una colaboración, una propuesta laboral o simplemente una idea que quieras compartir, este espacio está abierto para ti.",
  "project1Title": "Página web de una peluquería",
  "project1Desc": "Diseño de una página web ficticia para una peluquería, con estructura semántica y diseño responsive. Incluye navegación clara, secciones de servicios y contacto, y uso de componentes visuales con Bootstrap.",
  "project1Btn": "Visitar web",
  "project2Title": "Portfolio Personal",
  "project2Desc": "Este sitio web que estás visitando. Desarrollado para presentar mi perfil profesional, proyectos y contacto. He trabajado en la maquetación, accesibilidad y una navegación intuitiva que refleja mi estilo como diseñadora web.",
  "project2Btn": "Ver proyecto",
  "project3Title": "Página de videojuegos",
  "project3Desc": "Diseño experimental de una página temática sobre videojuegos. Utiliza Tailwind CSS para estilizar componentes, con enfoque en tipografía, colores y estructura modular.",
  "project3Btn": "Visitar web",
  "projectTech": "Tecnologías:",
  "project4Title": "Diseño en 3D",
  "project4Desc": "Proyecto experimental en el que he creado un personaje en 3D inspirado en el estilo de Minecraft. Utilicé Three.js para renderizar el modelo en el navegador, aplicando texturas básicas y control de cámara para explorar el entorno.",
  "backToHome": "Volver al inicio"



}
