{
  "langName": "Galego",
  "langFlag": "🌐",
  "navInicio": "Inicio",
  "navSobreMi": "Sobre min",
  "navProyectos": "Proxectos",
  "navContacto": "Contacto",
  "heroTitle": "Alba Reborido",
  "heroSubtitle": "Deseñadora Web • Frontend Developer",
  "heroDescription": "Apasióname transformar ideas en experiencias dixitais sinxelas e atractivas, pensadas para as persoas.",
  "heroBtn": "Ver os meus proxectos",
  "aboutTitle": "Sobre min",
  "aboutLead": "Apasióname transformar ideas en experiencias dixitais sinxelas e atractivas, pensadas para as persoas.",
  "aboutText": "Actualmente estou aprendendo e desenvolvendo proxectos propios, explorando novas ferramentas e técnicas para mellorar as miñas habilidades e entender mellor como crear solucións dixitais intuitivas e efectivas.",
  "projectsTitle": "Os meus Proxectos",
  "projectsDescription": "Cada un destes proxectos reflicte unha etapa na miña evolución como deseñadora web. Gozo explorando novas ferramentas e enfoques visuais, co obxectivo constante de perfeccionar a experiencia do usuario e elevar a calidade do código. Mantéñome aberta ao aprendizaxe continuo e aos desafíos que me permitan crecer profesionalmente.",
  "contactTitle": "Contacto",
  "contactDescription": "Se buscas unha deseñadora web creativa, comprometida e con ganas de seguir aprendendo, estarei encantada de coñecerte. Podes escribirme directamente a través do formulario ou contactar comigo por redes.",
  "contactName": "Nome",
  "contactEmail": "Correo electrónico",
  "contactMessage": "Mensaxe",
  "contactSend": "Enviar mensaxe",
  "contactNameError": "⚠️ Este campo é obrigatorio.",
  "contactEmailErrorEmpty": "⚠️ Introduce o teu correo electrónico.",
  "contactEmailErrorInvalid": "⚠️ O formato do correo non é válido.",
  "contactMessageError": "⚠️ Escribe unha mensaxe.",
  "contactLinksPrefix": "Podes escribirme directamente a",
  "contactLinksSuffix": "ou atoparme en redes:",
  "thankYouMessage": "Grazas pola túa mensaxe! Contactarei contigo o antes posible. Mentres, podes seguir explorando o meu traballo.",
  "footerCopyright": "© 2025 Alba Reborido – Deseñadora Web",
  "contactSummary": "Cada proxecto que realizo é unha oportunidade para aprender, medrar e conectar. Se che gustou o que viches e cres que poderiamos crear algo interesante xuntos, estarei encantada de escoitarte. Xa sexa unha colaboración, unha proposta laboral ou simplemente unha idea que queiras compartir, este espazo está aberto para ti.",
  "project1Title": "Páxina web dunha perruquería",
  "project1Desc": "Deseño dunha páxina web ficticia para unha perruquería, con estrutura semántica e deseño responsive. Inclúe navegación clara, seccións de servizos e contacto, e uso de compoñentes visuais con Bootstrap.",
  "project1Btn": "Visitar web",
  "project2Title": "Portfolio Persoal",
  "project2Desc": "Este sitio web que estás a visitar. Desenvolvido para presentar o meu perfil profesional, proxectos e contacto. Traballei na maquetación, accesibilidade e unha navegación intuitiva que reflicte o meu estilo como deseñadora web.",
  "project2Btn": "Ver proxecto",
  "project3Title": "Páxina de videoxogos",
  "project3Desc": "Deseño experimental dunha páxina temática sobre videoxogos. Utiliza Tailwind CSS para estilizar compoñentes, con enfoque na tipografía, cores e estrutura modular.",
  "project3Btn": "Visitar web",
  "projectTech": "Tecnoloxías:",
  "project4Title": "Deseño en 3D",
  "project4Desc": "Proxecto experimental no que creei un personaxe en 3D inspirado no estilo de Minecraft. Utilicei Three.js para renderizar o modelo no navegador, aplicando texturas básicas e control de cámara para explorar o entorno.",
  "backToHome": "Volver ao inicio"

}
