{
  "langName": "Português",
  "langFlag": "🌐",
  "navInicio": "Início",
  "navSobreMi": "Sobre mim",
  "navProyectos": "Projetos",
  "navContacto": "Contato",
  "heroTitle": "Alba Reborido",
  "heroSubtitle": "Web Designer • Desenvolvedora Frontend",
  "heroDescription": "Adoro transformar ideias em experiências digitais simples e atraentes, pensadas para pessoas.",
  "heroBtn": "Ver meus projetos",
  "aboutTitle": "Sobre mim",
  "aboutLead": "Adoro transformar ideias em experiências digitais simples e atraentes, pensadas para pessoas.",
  "aboutText": "Atualmente estou aprendendo e desenvolvendo meus próprios projetos, explorando novas ferramentas e técnicas para aprimorar minhas habilidades e entender melhor como criar soluções digitais intuitivas e eficazes.",
  "projectsTitle": "Meus Projetos",
  "projectsDescription": "Cada um desses projetos reflete uma etapa da minha evolução como web designer. Gosto de explorar novas ferramentas e abordagens visuais, com o objetivo constante de melhorar a experiência do usuário e elevar a qualidade do código. Estou sempre aberta ao aprendizado contínuo e a desafios que me permitam crescer profissionalmente.",
  "contactTitle": "Contato",
  "contactDescription": "Se você está procurando uma web designer criativa, comprometida e com vontade de continuar aprendendo, ficarei feliz em te conhecer. Você pode me escrever diretamente pelo formulário ou entrar em contato pelas redes sociais.",
  "contactName": "Nome",
  "contactEmail": "Email",
  "contactMessage": "Mensagem",
  "contactSend": "Enviar mensagem",
  "contactNameError": "⚠️ Este campo é obrigatório.",
  "contactEmailErrorEmpty": "⚠️ Por favor, insira seu endereço de email.",
  "contactEmailErrorInvalid": "⚠️ Formato de email inválido.",
  "contactMessageError": "⚠️ Por favor, escreva uma mensagem.",
  "thankYouMessage": "Obrigada pela sua mensagem! Responderei o mais breve possível. Enquanto isso, sinta-se à vontade para continuar explorando meu trabalho.",
  "contactLinksPrefix": "Você pode me escrever diretamente para",
  "contactLinksSuffix": "ou me encontrar nas redes sociais:",
  "footerCopyright": "© 2025 Alba Reborido – Web Designer",
  "contactSummary": "Cada projeto que crio é uma oportunidade para aprender, crescer e conectar. Se você gostou do que viu e acha que podemos criar algo interessante juntos, ficarei feliz em te ouvir. Seja uma colaboração, uma proposta de trabalho ou apenas uma ideia que queira compartilhar, este espaço está aberto para você.",
  "project1Title": "Site de Salão de Beleza",
  "project1Desc": "Design de um site fictício para um salão de beleza, com estrutura semântica e layout responsivo. Inclui navegação clara, seções de serviços e contato, e componentes visuais usando Bootstrap.",
  "project1Btn": "Visitar site",
  "project2Title": "Portfolio Pessoal",
  "project2Desc": "Este site que você está visitando. Desenvolvido para apresentar meu perfil profissional, projetos e informações de contato. Trabalhei no layout, acessibilidade e navegação intuitiva que refletem meu estilo como web designer.",
  "project2Btn": "Ver projeto",
  "project3Title": "Página de Videogame",
  "project3Desc": "Design experimental de uma página temática sobre videogames. Utiliza Tailwind CSS para estilizar os componentes, com foco em tipografia, cores e estrutura modular.",
  "project3Btn": "Visitar site",
  "projectTech": "Tecnologias:",
  "project4Title": "Design 3D",
  "project4Desc": "Projeto experimental onde criei um personagem 3D inspirado no estilo Minecraft. Usei Three.js para renderizar o modelo no navegador, aplicando texturas básicas e controle de câmera para explorar o ambiente.",
  "backToHome": "Voltar para o início"
}
